[
  {
    "DateWritten": "2023-04-01",
    "Name": "Stefan",
    "CountryOfOrigin": "Bulgaria",
    "Content": "A great house, a lot of space, furnished with style and taste :) Maintained well and very clean. Fully equipped kitchen - we cooked for ourselves most days and did not miss any appliance. Dishwasher was a great thing to have - we were 6 adults and 6 children. As we were there in the spring, it was great that the house had heating - that greatly increased our comfort! Our hostess Christine was of great help - she put up two folding beds and cribs for the babies. She allowed us to check in early, gave us information about the best supermarkets and restaurants and even made suggestions of what we might see and do in the days when the weather was worse.",
    "IsInvisible": false
  },
  {
    "DateWritten": "2023-06-01",
    "Name": "Dorin",
    "CountryOfOrigin": "Romania",
    "Content": "Fantastic property, probably one of the best on the island. The hosts are amazing and carrying. We totally enjoyed our stay. Score: 10. Everything was great!",
    "IsInvisible": false
  },
  {
    "DateWritten": "2022-07-01",
    "Name": "Konstantinos",
    "CountryOfOrigin": "Belgium",
    "Content": "Villa Monte Kariotes is a great place to spend a relaxing vacation! It is beautifully decorated and fully equipped with anything you may need. We enjoyed everything: the spacious rooms, the comfortable beds, the clean sheets, the brand-new kitchen utensils, the tidy bathroom, the lovely garden, and the cool swimming pool. All were accompanied by the light breeze, the shadow of the trees in the yard, and the calmness of the surroundings. The most amazing thing was the sky at night which was completely crowded with stars. It is said that one of the most important things about summer holidays is the type of accommodation you will be able to reserve. Villa Monte Kariotes is the best accommodation you can find in Samothrace! It is definitely worth every penny! I truly hope you will enjoy your stay there as much as my family and I did! Thank you Christin and Varvara for the great hospitality!!!",
    "IsInvisible": false
  },
  {
    "DateWritten": "2022-07-01",
    "Name": "Vilcu",
    "CountryOfOrigin": "Romania",
    "Content": "Villa Monte Kariotes was an awesome place to stay in Samothraki. We are honored to be the first guests and we recommend it to everyone who wants to follow us! It’s really nice located, with the view of the mountains and also the sea. The house was really clean and nicely designed. It looked just like in the photos! The guest left us everything we needed in it. Also, the garden was surrounded by flowers and nature. The pool was a perfect attraction for kids. They really liked it. The guest is extremely kind too. Such lovely people! We were welcomed with warm smiles and happiness. They were ready to help us with anything. They even bought us something from the bakery for breakfast and showed us the best restaurants, beaches, and waterfalls. They came every morning to check the pool and to see if everything is alright. We are so thankful to them. We will definitely come back! As the guest said.. : 'Villa Monte Kariotes leaves memories!'",
    "IsInvisible": false
  }
]